[sound1, fs1] = audioread('1.wav');
[sound2, fs2] = audioread('2.wav');
[sound3, fs3] = audioread('3.wav');
%截取同样长度
s1 = sound1(1:50000);
s2 = sound2(1:50000);
s3 = sound3(1:50000);
s1a = zeros(1, 150000);
s2a = zeros(1, 150000);
s3a = zeros(1, 150000);
for i = 1:50000
    s1a(3*i-2) = s1(i);
    s2a(3*i-2) = s2(i);
    s3a(3*i-2) = s3(i);
end
t1 = 1:50000;
t2 = 1:150000;
ftotal = zeros(1, 150000);
fs = 50000;
%过采样fft 频域重复
f1a = fft(s1a);
f2a = fft(s2a);
f3a = fft(s3a);
%按窗拼接
ftotal(1:25000) = f1a(1:25000);
ftotal(25001:50000) = f2a(1:25000);
ftotal(50001:75000) = f3a(1:25000);
ftotal(75001:100000) = f3a(25001:50000);
ftotal(100001:125000) = f2a(25001:50000);
ftotal(125001:150000) = f1a(25001:50000);
%编码
y = ifft(ftotal, 150000);

%-----------------------------------------
%解码
x = fft(y, 150000);
t3 = 1:150000;
f1t = zeros(1, 50000);
f2t = zeros(1, 50000);
f3t = zeros(1, 50000);
f1t(1:25000) = x(1:25000);
f1t(25001:50000) = x(125001:150000);
f2t(1:25000) = x(25001:50000);
f2t(25001:50000) = x(100001:125000);
f3t(1:25000) = x(50001:75000);
f3t(25001:50000) = x(75001:100000);
x1 = ifft(f1t);
x2 = ifft(f2t);
x3 = ifft(f3t);
